# ServerId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalResourceBrowserData..::..ServerId Property
ExternalResourceBrowserData Class See Also
---
The Id of IExternalResourceServer which handles the external resource load.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public Guid ServerId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ServerId As Guid
	Get
```

Visual C++
---
```text
public:
property Guid ServerId {
	Guid get ();
}
```

# See Also
ExternalResourceBrowserData Class
Autodesk.Revit.DB Namespace